ЕСКД/src/Catalogs/mega_Спецификации/mega_Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Спецификации</name>
  <basedOn>Catalog.mega_ШаблоныСпецификаций</basedOn>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииОбработки</name>
    <attributes>
      <name>ВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_ШаблоныСпецификаций/mega_ШаблоныСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_ШаблоныСпецификаций</name>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_ШаблоныСпецификаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_Спецификации/ObjectModule.bsl
Функция ПолучитьВыборкуПолейШаблонаСпецификации(ШаблонСпецификации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	mega_ШаблоныСпецификаций.Наименование КАК Наименование,
	|	mega_ШаблоныСпецификаций.Количество КАК Количество,
	|	mega_ШаблоныСпецификаций.Материалы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Спецификация КАК Спецификация
	|	) КАК Материалы,
	|	mega_ШаблоныСпецификаций.ТехнологическиеОперации.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВремяВыполнения КАК ВремяВыполнения
	|	) КАК ТехнологическиеОперации
	|ИЗ
	|	Справочник.mega_ШаблоныСпецификаций КАК mega_ШаблоныСпецификаций
	|ГДЕ
	|	mega_ШаблоныСпецификаций.Ссылка = &ШаблонСпецификации";
	
	Запрос.УстановитьПараметр("ШаблонСпецификации", ШаблонСпецификации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

Процедура ЗаполнитьПоШаблонуСпецификации(ШаблонСпецификации)
	
	ВыборкаДетальныеЗаписи = ПолучитьВыборкуПолейШаблонаСпецификации(ШаблонСпецификации);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЭтотОбъект.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		ЭтотОбъект.Количество = ВыборкаДетальныеЗаписи.Количество;
		
		ЭтотОбъект.Материалы.Очистить();
		
		ВыборкаМатериалы = ВыборкаДетальныеЗаписи.Материалы.Выбрать();
		Пока ВыборкаМатериалы.Следующий() Цикл
			
			НоваяСтрока = ЭтотОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалы);
		КонецЦикла;
		
		ЭтотОбъект.ТехнологическиеОперации.Очистить();
		
		ВыборкаТехнологическиеОперации = ВыборкаДетальныеЗаписи.ТехнологическиеОперации.Выбрать();
		Пока ВыборкаТехнологическиеОперации.Следующий() Цикл
			
			НоваяСтрока = ЭтотОбъект.ТехнологическиеОперации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТехнологическиеОперации);
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
	КонецЕсли;  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.mega_ШаблоныСпецификаций") Тогда
		
		 ЗаполнитьПоШаблонуСпецификации(ДанныеЗаполнения);		
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	mega_СпецификацииСтадииОбработки.ВидСтадииОбработки КАК ВидСтадииОбработки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ mega_СпецификацииСтадииОбработки.ВидСтадииОбработки) КАК Количество
	|ИЗ
	|	Справочник.mega_Спецификации.СтадииОбработки КАК mega_СпецификацииСтадииОбработки
	|ГДЕ
	|	mega_СпецификацииСтадииОбработки.Ссылка = &Спецификация
	|
	|СГРУППИРОВАТЬ ПО
	|	mega_СпецификацииСтадииОбработки.ВидСтадииОбработки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	
	Запрос.УстановитьПараметр("Спецификация", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
	
		Если Выборка.Количество > 1 Тогда 
			
			ОбщегоНазначения.СообщитьПользователю("Не допустимо использовать одинаковые стадии обработки",,,, Отказ);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
